yuplus/nxp-mcx-series/MCXE247/drivers/fsl_ftm.h
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2022, 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#ifndef FSL_FTM_H_
#define FSL_FTM_H_

#include "fsl_common.h"

/*!
 * @addtogroup ftm
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*! @{ */
/*! @brief FTM driver version 2.7.1. */
#define FSL_FTM_DRIVER_VERSION (MAKE_VERSION(2, 7, 1))
/*! @} */

/*!
 * @brief List of FTM channels
 * @note Actual number of available channels is SoC dependent
 */
typedef enum _ftm_chnl
{
    kFTM_Chnl_0 = 0U, /*!< FTM channel number 0 */
    kFTM_Chnl_1,      /*!< FTM channel number 1 */
    kFTM_Chnl_2,      /*!< FTM channel number 2 */
    kFTM_Chnl_3,      /*!< FTM channel number 3 */
    kFTM_Chnl_4,      /*!< FTM channel number 4 */
    kFTM_Chnl_5,      /*!< FTM channel number 5 */
    kFTM_Chnl_6,      /*!< FTM channel number 6 */
    kFTM_Chnl_7       /*!< FTM channel number 7 */
} ftm_chnl_t;

/*! @brief List of FTM faults */
typedef enum _ftm_fault_input
{
    kFTM_Fault_0 = 0U, /*!< FTM fault 0 input pin */
    kFTM_Fault_1,      /*!< FTM fault 1 input pin */
    kFTM_Fault_2,      /*!< FTM fault 2 input pin */
    kFTM_Fault_3       /*!< FTM fault 3 input pin */
} ftm_fault_input_t;

/*! @brief FTM PWM operation modes */
typedef enum _ftm_pwm_mode
{
    kFTM_EdgeAlignedPwm = 0U,      /*!< Edge-aligned PWM */
    kFTM_CenterAlignedPwm,         /*!< Center-aligned PWM */
    kFTM_EdgeAlignedCombinedPwm,   /*!< Edge-aligned combined PWM */
    kFTM_CenterAlignedCombinedPwm, /*!< Center-aligned combined PWM */
#if (defined(FSL_FEATURE_FTM_HAS_MODIFIED_COMBINE_PWM) && FSL_FEATURE_FTM_HAS_MODIFIED_COMBINE_PWM)
    kFTM_ModifiedCombinedPwm,      /*!< Modified combined PWM */
#endif  /* FSL_FEATURE_FTM_HAS_MODIFIED_COMBINE_PWM */
    kFTM_AsymmetricalCombinedPwm   /*!< Asymmetrical combined PWM */
} ftm_pwm_mode_t;

/*! @brief FTM PWM output pulse mode: high-true, low-true or no output 
 *  @note  kFTM_NoPwmSignal: ELSnB:ELSnA = 0:0
 *         kFTM_LowTrue: ELSnB:ELSnA = 0:1
 *         EPWM: Channel n output is forced low at counter overflow, forced high at channel n match.
 *         CPWM: Channel n output is forced low at channel n match when counting down, and forced high
 *               at channel n match when counting up.
 *         Combined PWM: Channel n output is forced high at beginning of period and at channel n+1 match.
 *                       It is forced low at the channel n match.
 *         kFTM_HighTrue: ELSnB:ELSnA = 1:0
 *         EPWM: Channel n output is forced high at counter overflow, forced low at channel n match.
 *         CPWM: Channel n output is forced high at channel n match when counting down, and forced low
 *               at channel n match when counting up.
 *         Combined PWM: Channel n output is forced low at beginning of period and at channel n+1 match.
 *                       It is forced high at the channel n match.
 */
typedef enum _ftm_pwm_level_select
{
    kFTM_NoPwmSignal = 0U, /*!< No PWM output on pin */
    kFTM_LowTrue,          /*!< Low true pulses */
    kFTM_HighTrue          /*!< High true pulses */
} ftm_pwm_level_select_t;

/*! @brief Options to configure a FTM channel's PWM signal */
typedef struct _ftm_chnl_pwm_signal_param
{
    ftm_chnl_t chnlNumber;         /*!< The channel/channel pair number.
                                        In combined mode, this represents the channel pair number. */
    ftm_pwm_level_select_t level;  /*!< PWM output active level select. */
    uint8_t dutyCyclePercent;      /*!< PWM pulse width, value should be between 0 to 100
                                        0 = inactive signal(0% duty cycle)...
                                        100 = always active signal (100% duty cycle).*/
    uint8_t firstEdgeDelayPercent; /*!< Used only in kFTM_AsymmetricalCombinedPwm mode to generate an asymmetrical PWM.
                                        Specifies the delay to the first edge in a PWM period.
                                        If unsure leave as 0; Should be specified as a
                                        percentage of the PWM period */
    bool enableComplementary;      /*!< Used only in combined PWM mode.
                                        true: The combined channels output complementary signals;
                                        false: The combined channels output same signals; */
    bool enableDeadtime;           /*!< Used only in combined PWM mode with enable complementary.
                                        true: The deadtime insertion in this pair of channels is enabled;
                                        false: The deadtime insertion in this pair of channels is disabled. */
} ftm_chnl_pwm_signal_param_t;

/*! @brief Options to configure a FTM channel using precise setting.*/
typedef struct _ftm_chnl_pwm_config_param
{
    ftm_chnl_t chnlNumber;        /*!< The channel/channel pair number.
                                       In combined mode, this represents the channel pair number. */
    ftm_pwm_level_select_t level; /*!< PWM output active level select. */
    uint16_t dutyValue;           /*!< PWM pulse width, the uint of this value is timer ticks. */
    uint16_t firstEdgeValue;      /*!< Used only in kFTM_AsymmetricalCombinedPwm mode to generate an asymmetrical PWM.
                                       Specifies the delay to the first edge in a PWM period.
                                       If unsure leave as 0, uint of this value is timer ticks. */
    bool enableComplementary;     /*!< Used only in combined PWM mode.
                                       true: The combined channels output complementary signals;
                                       false: The combined channels output same signals; */
    bool enableDeadtime;          /*!< Used only in combined PWM mode with enable complementary.
                                       true: The deadtime insertion in this pair of channels is enabled;
                                       false: The deadtime insertion in this pair of channels is disabled. */
} ftm_chnl_pwm_config_param_t;

/*! @brief General options to configure a FTM channel using precise setting.*/
typedef struct _ftm_chnl_param
{
    ftm_pwm_mode_t mode;          /*!< PWM output mode. */
    ftm_pwm_level_select_t level; /*!< PWM output active level select. */
    uint16_t initialValue;        /*!< FTM counter initial value. */
    uint16_t moduloValue;         /*!< FTM counter modulo value. */
    uint16_t chnlValue;           /*!< FTM channel n match value. */
    uint16_t combinedChnlValue;   /*!< FTM combined channel n+1 match value,
                                       used only in (modified) combined PWM mode. */
    bool enableComplementary;     /*!< Used only in combined PWM mode.
                                       true: The combined channels output complementary signals;
                                       false: The combined channels output same signals; */
    bool enableDeadtime;          /*!< Used only in combined PWM mode with enable complementary.
                                       true: The deadtime insertion in this pair of channels is enabled;
                                       false: The deadtime insertion in this pair of channels is disabled. */
#if defined(FSL_FEATURE_FTM_HAS_TRIGGER_MODE) && (FSL_FEATURE_FTM_HAS_TRIGGER_MODE)
    bool enablePulseOutput;     /*!< Used only in Edge-aligned PWM and Center-aligned PWM.
                                     true: If a match in channel occurs, a trigger pulse with one FTM input clock
                                           width is generated in the channel n;
                                     false: Channel outputs will generate normal PWM outputs without generating a
                                            pulse. */
#endif  /* FSL_FEATURE_FTM_HAS_TRIGGER_MODE */
#if (defined(FSL_FEATURE_FTM_HAS_DITHERING) && FSL_FEATURE_FTM_HAS_DITHERING)
    bool enableDithering;       /*!< Enable fractional delay to achieve fine resolution on generated PWM signals.
                                     true: Enable dithering;
                                     false: Disable dithering. */
    uint8_t moduloFracValue;        /*!< Modulo fractional value, used in Period Dithering. */
    uint8_t chnlFracValue;          /*!< Channel n match fractional value, used in Edge Dithering. */
    uint8_t combinedChnlFracValue;  /*!< Combined channel n+1 match fractional value, used in Edge Dithering.
                                         It is recommended to use only one PWM Edge Dithering (channel n PWM Edge
                                         Dithering or channel n+1 PWM Edge Dithering) at a time.*/
#endif  /* FSL_FEATURE_FTM_HAS_DITHERING */
} ftm_chnl_param_t;

